sinhala_roman = {
    "අ": "a",
    "ආ": "ā",
    "ඇ": "æ",
    "ඈ": "ǣ",
    "ඉ": "i",
    "ඊ": "ī",
    "උ": "u",
    "ඌ": "ū",
    "එ": "e",
    "ඒ": "ē",
    "ඓ": "ai",
    "ඔ": "o",
    "ඕ": "ō",
    "ඖ": "au",
    "ඍ": "ṛ",
    "ඎ": "ṝ",
    "ඏ": "l̥",
    "ඐ": "ḹ",
    "ක": "ka",
    "ඛ": "kha",
    "ග": "ga",
    "ඝ": "gha",
    "ඞ": "ṅa",
    "ඟ": "n̆ga",
    "ච": "ca",
    "ඡ": "cha",
    "ජ": "ja",
    "ඣ": "jha",
    "ඤ": "ña",
    "ඥ": "jña",
    "ඦ": "ñja",
    "ට": "ṭa",
    "ඨ": "ṭha",
    "ඩ": "ḍa",
    "ඪ": "ḍha",
    "ණ": "ṇa",
    "ඬ": "n̆ḍa",
    "ත": "ta",
    "ථ": "tha",
    "ද": "da",
    "ධ": "dha",
    "න": "na",
    "ඳ": "n̆da",
    "ප": "pa",
    "ඵ": "pha",
    "බ": "ba",
    "භ": "bha",
    "ම": "ma",
    "ඹ": "m̆ba",
    "ය": "ya",
    "ර": "ra",
    "ල": "la",
    "ළ": "ḷa",
    "ව": "va",
    "හ": "ha",
    "ශ": "śa",
    "ෂ": "ṣa",
    "ක්‍ෂ": "ṣa",
    "ස": "sa",
    "ෆ": "fa"
}

roman_phoneme = {
    "a": [
        "ʌ",
        "AH0"
    ],
    "ā": [
        "aː",
        "AA1"
    ],
    "æ": [
        "æ",
        "AE0"
    ],
    "ǣ": [
        "æː",
        "AE1"
    ],
    "i": [
        "i",
        "IH1"
    ],
    "ī": [
        "iː",
        "IY1"
    ],
    "u": [
        "u",
        "UH1"
    ],
    "ū": [
        "uː",
        "UW1"
    ],
    "e": [
        "ɛ",
        "EH1"
    ],
    "ē": [
        "eː",
        "EY1"
    ],
    "ai": [
        "ai",
        "AY1"
    ],
    "o": [
        "o",
        "AO0"
    ],
    "ō": [
        "ɔː",
        "AO1"
    ],
    "au": [
        "aʊ",
        "AW1"
    ],
    "ṛ": [
        "ɾɨ",
        "R IH"
    ],
    "ṝ": [
        "ɾɨː",
        "R IY1"
    ],
    "l̥": [
        "lɨ",
        "L IH"
    ],
    "ḹ": [
        "lɨː",
        "L IY1"
    ],
    "k": [
        "k",
        "K"
    ],
    "kh": [
        "kʰ",
        "K HH"
    ],
    "g": [
        "g",
        "G"
    ],
    "gh": [
        "ɡʱ",
        "G HH"
    ],
    "ṅ": [
        "ŋ",
        "NG"
    ],
    "n̆g": [
        "ŋɡ",
        "NG G"
    ],
    "c": [
        "t͡ʃ",
        "CH"
    ],
    "ch": [
        "t͡ʃʰ",
        "CH HH"
    ],
    "j": [
        "dʒ",
        "JH"
    ],
    "jh": [
        "d͡ʒʱ",
        "JH HH"
    ],
    "ñ": [
        "ɲ",
        "Y"
    ],
    "jñ": [
        "ʥ",
        "JH Y"
    ],
    "ñj": [
        "nɖʒ",
        "N JH"
    ],
    "ṭ": [
        "ʈ",
        "T"
    ],
    "ṭh": [
        "ʈʰ",
        "T HH"
    ],
    "ḍ": [
        "ɖ",
        "D"
    ],
    "ḍh": [
        "ɖʱ",
        "D HH"
    ],
    "ṇ": [
        "ɳ",
        "N"
    ],
    "n̆ḍ": [
        "ɳɖ",
        "N D"
    ],
    "t": [
        "t",
        "TH"
    ],
    "th": [
        "tʰ",
        "TH HH"
    ],
    "d": [
        "d",
        "D"
    ],
    "dh": [
        "dʰ",
        "D HH"
    ],
    "n": [
        "n",
        "N"
    ],
    "n̆d": [
        "ⁿd",
        "N D HH"
    ],
    "p": [
        "p",
        "P"
    ],
    "ph": [
        "pʰ",
        "P HH"
    ],
    "b": [
        "b",
        "B"
    ],
    "bh": [
        "bʰ",
        "B HH"
    ],
    "m": [
        "m",
        "M"
    ],
    "m̆b": [
        "ᵐb",
        "M B"
    ],
    "y": [
        "j",
        "Y"
    ],
    "r": [
        "r",
        "R"
    ],
    "l": [
        "l",
        "L"
    ],
    "ḷ": [
        "ɭ",
        "L R"
    ],
    "v": [
        "v",
        "V"
    ],
    "h": [
        "h",
        "HH"
    ],
    "ś": [
        "ʒ",
        "ZH"
    ],
    "ṣ": [
        "ʃ",
        "SH"
    ],
    "s": [
        "s",
        "S"
    ],
    "f": [
        "f",
        "F"
    ]
}